ProgessBase/Documents/ПланДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПланДвиженияДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПланыДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ПРГ_ОстаткиПоБюджетам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СарехОрех</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПРГ_СарехОрех</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДвиженияДенежныхСредств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриходРасход</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДвиженийПриходРасход</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийЗаявкиНаРасходование</v8:Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийПланируемоеПоступлениеДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма в валюте банковского счета (кассы)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ПланыДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПланыДвиженияДенежныхСредств</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриходРасход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийПриходРасход</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ПРГ_ОстаткиПоБюджетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПРГ_ОстаткиПоБюджетам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыРаспределенияПоПроектам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СарехОрех</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПРГ_СарехОрех</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРасходованиеСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/Enums/ВидыДвиженийПриходРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДвиженийПриходРасход</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Documents/ПланДвиженияДенежныхСредств/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

#Если Клиент Тогда

Процедура ПечатьОтчетаПланыДвиженияДенежныхСредств()
	
	Отчет = Отчеты.ПланыДвиженияДенежныхСредств.Создать();
	
	Отчет.УстановитьНачальныеНастройки();
		
	Пока Отчет.УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Количество() > 0 Цикл
			
		Отчет.УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Удалить(Отчет.УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки[0]);
			
	КонецЦикла;
		
	Пока Отчет.УниверсальныйОтчет.ПостроительОтчета.ИзмеренияКолонки.Количество() > 0 Цикл
			
		Отчет.УниверсальныйОтчет.ПостроительОтчета.ИзмеренияКолонки.Удалить(Отчет.УниверсальныйОтчет.ПостроительОтчета.ИзмеренияКолонки[0]);
			
	КонецЦикла;
		
	Пока Отчет.УниверсальныйОтчет.ПостроительОтчета.ВыбранныеПоля.Количество() > 0 Цикл
			
		Отчет.УниверсальныйОтчет.ПостроительОтчета.ВыбранныеПоля.Удалить(Отчет.УниверсальныйОтчет.ПостроительОтчета.ВыбранныеПоля[0]);
			
	КонецЦикла;
		
	Отчет.УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ВалютаДенежныхСредств");
	Отчет.УниверсальныйОтчет.ДобавитьИзмерениеСтроки("СтатьяДвиженияДенежныхСредств");
		
	ЭлементОтбора = Отчет.УниверсальныйОтчет.ПостроительОтчета.Отбор.Добавить("ДокументПланирования");
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ВидСравнения = ВидСравнения.Равно;
	ЭлементОтбора.Значение = Ссылка;
	
	ЭлементОтбора = Отчет.УниверсальныйОтчет.ПостроительОтчета.Отбор.Добавить("Сценарий");
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ВидСравнения = ВидСравнения.Равно;
	ЭлементОтбора.Значение = Сценарий;
	
	Отчет.УниверсальныйОтчет.ДатаНач = ДатаПланирования;
	Отчет.УниверсальныйОтчет.ДатаКон = ОбщегоНазначения.ДобавитьИнтервал(ДатаПланирования, Сценарий.Периодичность, 1) - 1;
	
	Отчет.УниверсальныйОтчет.ДобавитьПоказатель("СуммаРасходВал", "Платежи", Истина, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютепланирования");
	Отчет.УниверсальныйОтчет.ДобавитьПоказатель("СуммаРасходУпр", "Платежи", Истина, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютеУпрУчета");
	
	Отчет.УниверсальныйОтчет.мВосстанавливатьНастройкиПриОткрытии = Ложь;
		
	ФормаОтчета = Отчет.ПолучитьФорму();
	ФормаОтчета.Открыть();
	ФормаОтчета.ОбновитьОтчет();

КонецПроцедуры // ПечатьОтчетаПланыДвиженияДенежныхСредств()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() ИЛИ (НЕ Проведен) Тогда
		Предупреждение("Документ можно распечатать только после его проведения.");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если ИмяМакета = "ПланыДвиженияДенежныхСредств" тогда

		ПечатьОтчетаПланыДвиженияДенежныхСредств();

	КонецЕсли;

КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ПланыДвиженияДенежныхСредств", "План движения денежных средств");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли

// Выполняет движения по регистру "ПланыДвиженияДенежныхСредств"
//
Процедура ДвиженияПоРегистрамУпр()
	
	ВалютаУпрУчета = глЗначениеПеременной("ВалютаУправленческогоУчета");
	
	// Получим коэффициент пересчета сумм документа в валюту упр. учета.
	Если ВалютаДокумента = ВалютаУпрУчета Тогда
		КоэффициентПересчетаУпр = 1;
	Иначе
		
		Если Сценарий.ИспользоватьКурсыСценария Тогда
			РегистрКурсов = РегистрыСведений.КурсыВалютПоСценариям;
			
			ОтборПоВалютеУпр = Новый Структура;
			ОтборПоВалютеУпр.Вставить("Валюта",   ВалютаУпрУчета);
			ОтборПоВалютеУпр.Вставить("Сценарий", Сценарий);
			
			ОтборПоВалютеДок = Новый Структура;
			ОтборПоВалютеДок.Вставить("Валюта",   ВалютаДокумента);
			ОтборПоВалютеДок.Вставить("Сценарий", Сценарий);
			
		Иначе
			
			РегистрКурсов = РегистрыСведений.КурсыВалют;
			
			ОтборПоВалютеУпр = Новый Структура;
			ОтборПоВалютеУпр.Вставить("Валюта", ВалютаУпрУчета);
			
			ОтборПоВалютеДок = Новый Структура;
			ОтборПоВалютеДок.Вставить("Валюта", ВалютаДокумента);
			
		КонецЕсли;
		
		СтруктураКурсовУпр = РегистрКурсов.ПолучитьПоследнее(ДатаПланирования, ОтборПоВалютеУпр);
		КурсУпрУчета       = СтруктураКурсовУпр.Курс;
		КратностьУпрУчета  = СтруктураКурсовУпр.Кратность;
		
		СтруктураКурсовДок = РегистрКурсов.ПолучитьПоследнее(ДатаПланирования, ОтборПоВалютеДок);
		КурсДок            = СтруктураКурсовДок.Курс;
		КратностьДок       = СтруктураКурсовДок.Кратность;
		
		Если КурсДок = 0 
			или КратностьДок = 0 
			или КурсУпрУчета = 0 
			или КратностьУпрУчета = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("При пересчете в валюту упр. учета обнаружен нулевой курс.");
			Возврат;
		Иначе	
			КоэффициентПересчетаУпр=(КурсДок * КратностьУпрУчета) / (КурсУпрУчета * КратностьДок)
		КонецЕсли;
		
	КонецЕсли;
	
	// По регистру "ПланыДвиженийДенежныхСредств"
	НаборДвижений = Движения.ПланыДвиженияДенежныхСредств;
	
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	// <- Шевченков
	НаборДвиженийОстаткиПоСтатьям   = Движения.ПРГ_ОстаткиПоБюджетам;
	ТаблицаДвиженийОстаткиПоСтатьям = НаборДвиженийОстаткиПоСтатьям.Выгрузить();
	ТаблицаДвиженийОстаткиПоСтатьям.Очистить();
	// ->
	
	Для Каждого Строка ИЗ ДвиженияДенежныхСредств Цикл
		
		СтрокаДвижение = ТаблицаДвижений.Добавить();
		СтрокаДвижение.Сценарий                      = Сценарий;
		СтрокаДвижение.ВидДенежныхСредств            = ВидДенежныхСредств;
		СтрокаДвижение.ПриходРасход                  = Строка.ПриходРасход;
		СтрокаДвижение.ВалютаДенежныхСредств         = ВалютаДокумента;
		СтрокаДвижение.СтатьяДвиженияДенежныхСредств = Строка.СтатьяДвиженияДенежныхСредств;
		СтрокаДвижение.Проект                        = Строка.Проект;
		СтрокаДвижение.Контрагент                    = Строка.Контрагент;
		СтрокаДвижение.ДоговорКонтрагента            = Строка.ДоговорКонтрагента;
		СтрокаДвижение.Сделка                        = Строка.Сделка;
		СтрокаДвижение.ДокументПланирования          = Ссылка;
		
		СтрокаДвижение.Сумма    = Строка.Сумма;
		СтрокаДвижение.СуммаУпр = Строка.Сумма * КоэффициентПересчетаУпр;
		
		// <- Шевченков
		Если Строка.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Расход Тогда
			
			СтрокаДвижениеОстаткиПоСтатьям = ТаблицаДвиженийОстаткиПоСтатьям.Добавить();
			
			СтрокаДвижениеОстаткиПоСтатьям.Подразделение = Ссылка.Подразделение;
			СтрокаДвижениеОстаткиПоСтатьям.СтатьяДДС     = Строка.СтатьяДвиженияДенежныхСредств;
			СтрокаДвижениеОстаткиПоСтатьям.Проект        = ?(ЗначениеЗаполнено(Строка.Проект), Строка.Проект, Неопределено);
			СтрокаДвижениеОстаткиПоСтатьям.Сумма         = Строка.Сумма * КоэффициентПересчетаУпр;
			СтрокаДвижениеОстаткиПоСтатьям.Период        = ?(ДатаПланирования<>'00010101',НачалоМесяца(ДатаПланирования),НачалоМесяца(Дата));// НачалоМесяца(Ссылка.Дата);
			//начало изменений БП 06 
			СтрокаДвижениеОстаткиПоСтатьям.СарехОрех     = СарехОрех;
			//конец изменений БП 06 
			
		КонецЕсли;     
		// ->
		
	КонецЦикла;        	
	
	НаборДвижений.мПериод            = ДатаПланирования;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Движения.ПланыДвиженияДенежныхСредств.ВыполнитьДвижения();   	
	
	НаборДвиженийОстаткиПоСтатьям.мПериод            = НачалоМесяца(Ссылка.Дата);
	НаборДвиженийОстаткиПоСтатьям.мТаблицаДвижений   = ТаблицаДвиженийОстаткиПоСтатьям;
	
	Движения.ПРГ_ОстаткиПоБюджетам.ВыполнитьДвижения();
	
КонецПроцедуры // ДвиженияПоРегистрамУпр()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	 
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	Отказ=Ложь;
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, Новый Структура("ВалютаДокумента,ДатаПланирования,ВидДенежныхСредств"), Отказ, Заголовок);
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ДвиженияДенежныхСредств", Новый Структура("ПриходРасход,СтатьяДвиженияДенежныхСредств",
													"Не заполнен вид движения","Не заполнена статья движения денежных средств"),Отказ, Заголовок);
													
	Если Не Отказ Тогда
		
		ДвиженияПоРегистрамУпр();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
	ПроверяемыеРеквизиты.Добавить("СарехОрех");
КонецПроцедуры
